{
  "calendar": [
    {
      "date": "4",
      "day": "Wednesday",
      "description": "Trainings",
      "events": [
        {
          "title": "Basic Training: Radare2 survival training",
          "speakers": [
            "xvilka",
            "maijin",
            "jvoisin",
            "deroad"
          ],
          "handles": [
            "akochkov",
            "maijin212",
            "jvoisin",
            "der0ad"
          ],
          "description": "<p>Since ancient history, humanity seeks the answer to the essential properties of software systems. To date the best answer known is UNIX. In this training, we will pull the dust off the old concepts, and refit them to the modern world of reverse engineering. During these few hours, we will learn how to survive in a console jungle without even guide.</p><p>Step by step, trainers will show you the radare2 powers, both basic and hidden: from the simple disassembly and file formats analysis to the scripting and emulating, from the debugging to recording the traces and combining radare2 with other tools. We will cover core features and standard tools from the radare2 kit. In no time, everyone, who knows how to type and know the basics of reverse engineering, will be able to juggle radare2 commands in the console to impress his friends and family.</p>",
          "time": "10:00 - 19:00"
        },
        {
          "title": "Advanced Training: Mobile Reverse Engineering with R2frida",
          "speakers": [
            "Edu Novella",
            "Alex Soler",
	    "Grant Douglas"
          ],
          "handles": [
            "enovella_",
            "as0ler",
	    "hexploitable"
          ],
          "description": "<p>Combining dynamic with static analysis is the key to quickly solving many challenges when performing binary analysis. Have you ever thought about combining Radare2 with Frida? This combination has given birth to \"r2frida\", an IO plugin that allows you to put the power of Frida into r2land.</p><p>During this workshop, we will walk you through how to use r2frida, primarily on mobile apps. Attendees will learn about offensive mobile security, e.g how to unpack malware, bypass jailbreak protections, SSL pinning, anti-debugging or even Frida detections using Frida itself. The workshop is suitable for pentesters, reversers, malware analysts and mobile developers who want to learn more about mobile security</p>",
          "time": "10:00 - 19:00"
        }
      ]
    },
    {
      "date": "5",
      "day": "Thursday",
      "description": "Trainings",
      "events": [
        {
          "title": "Basic Training: Radare2 Developing Internals",
          "speakers": "Pancake",
          "handles": "trufae",
          "description": "<p>Learning how to fix bugs, add new features, write plugins or modify the behaviour of any command in r2 by modifying its source is a very important task for any hacker, not just to make it work in the way you like but also to understand better the internals and small details.</p><p>The knowledge adquired in the training can be applied to other opensource projects, so it is interesting not just to anybody that wants to contribute to the project, but also for those who want to learn better good coding practices in C.</p>",
          "time": "10:00 - 14:00"
        },
        {
          "title": "Basic Training: Dissecting binaries with Cutter",
          "speakers": [
            "Antide Petit",
            "Itay Cohen (Check Point Research)",
            "Florian Märkl"
          ],
          "handles": [
            "xarkes_",
            "megabeets_",
            "thestr4ng3r"
          ],
          "description": "<p>Who said radare2 does not have a decent GUI? Cutter is The official multi-platform GUI for radare2. Its goal is making an advanced, customizable and FOSS reverse-engineering platform while keeping the user experience at mind.</p><p>In this training we will take you to a journey inside Cutter. We'll explore many features of Cutter through real-life examples and we will get our hands dirty with analyzing a malware found in the wild. You will also learn how we can script and extend Cutter with C++ and Python plugins. And last, for those of you who are radare2 junkies, don't worry - we will learn how you can use radare2 commands straight within Cutter.</p>",
          "time": "16:00 - 19:00"
        },
        {
          "title": "Advanced Training: Advanced Techniques for Semi-automatic Code Deobfuscation",
          "speakers": "Tim Blazytko",
          "handles": "mr_phrazer",
          "description": "<p>In modern businesses, code obfuscation has become a vital tool to protect, for example, intellectual property against competitors. In general, it attempts to impede program understanding by making the to-be-protected program more complex.</p><p>In this workshop, we give a basic overview about common code obfuscation techniques and deobfuscation techniques. In the second part, we introduce advanced techniques such as compiler optimizations and symbolic execution and use them to break state-of-the art code protections schemes in a semi-automatic manner. The workshop is suitable for everyone who has experience in reverse engineering of x86 code and wants to deepen his/her knowledge in advanced program analysis or code obfuscation techniques</p>",
          "time": "10:00 - 19:00"
        }
      ]
    },
    {
      "date": "6",
      "day": "Friday",
      "description": "Conference talks",
      "events": [
        {
          "title": "Welcome talk",
          "time": "09:00 - 09:15",
          "speakers": "r2con staff"
        },
        {
          "title": "Cutter - The radare2 GUI",
          "speakers": [
            "Antide Petit",
            "Itay Cohen (Check Point Research)",
            "Florian Märkl"
          ],
          "handles": [
            "xarkes_",
            "megabeets_",
            "thestr4ng3r"
          ],
          "description": "<p>Cutter is a powerful open-source, multi-platform GUI that is powered by radare2. Cutter was created to provide an easy-to-use, but still powerful, interface to radare2 for new users and for anyone who wants more GUI in their life.</p><p>In this talk we will take you to the journey of creating and maintaining Cutter. We will discuss the current state of the project as well as its future. Let's talk about our goals, successes and failures and even share some takeouts following the recent release of Ghidra.</p>",
          "time": "09:20 - 9:50"
        },
        {
          "title": "So now you don't like shellcodes too?",
          "speakers": "unixfreaxjp",
          "handles": "unixfreaxjp",
          "description": "<p>Shellcode is often spotted to execute a malformed code in a way that</p><p>can trigger the injection or further exploitation process, mostly in offensive ways.</p><p>In this presentation I would like to present the way I use radare2 in handling several shellcode cases I dealt on multiple operating systems and architectures. But beforehand I will try to present several categories of them in a simple and practical ways that maybe can help other analysts or beginners to help their work on their blue teamer field. In the end of presentation a case(s) of dissection obfuscated shellcode will be presented.</p>",
          "time": "9:55 - 10:25"
        },
        {
          "title": "Who you gonna' syscall: using automation to analyze protected iOS apps",
          "speakers": "Grant Douglas",
          "handles": "Hexploitable",
          "description": "<p>Analyzing protected apps can be slow and painful and often you don't have a lot of time to spend on these activities. During this talk, we'll look at how we can use r2pipe to speed up some of the common tasks that help make reversing protected iOS apps even easier.</p>",
          "time": "10:25 - 10:55"
        },
        {
          "title": "20 minutes break",
          "time": "11:00 - 11:20"
        },
        {
          "title": "Towards Side Channel Attacks",
          "speakers": "Marios Dimitriadis",
          "description": "<p>Side Channel Attacks have become prevalent both as a technique and as a topic. In this talk the possibility of gathering sensitive mobile app information will be analysed through the usage of a website that is loaded either directly by the app or by a third party library that the app uses. The tools utilised will be the [Radare](https://rada.re/r/) reverse engineering framework for the examination of the source code of the app in question, and the [Frida](https://www.frida.re) instrumentation framework for the injection of any code necessary during the execution of the app, which will revolve around the requirements of being able to execute JavaScript. The scope of the information that can be possibly gathered will be more relevant to privacy rather than security, and will include mainly data on the users, rather than on the devices in question. This is one of the main points of how it differs from attacks like Spectre which are capable of retrieving system security related data.<br /> More specifically, what will be covered (not necessarily in this order):<ul><li> - Summary of how CPU caches work</li><li>Summary of Side Channel attacks and how they can be performed in this specific case</li><li>Showcase of how Radare and Frida were used to aid the purposes mentioned</li></ul></p>",
          "time": "11:20 - 11:40"
        },
        {
          "title": "RetDec Decompiler Internals + radare2 & Cutter Integration",
          "speakers": [
            "Peter Matula",
            "Marek Milkovic"
          ],
          "handles": [
            "",
            ""
          ],
          "description": "<p>After a light & short RetDec introduction, we dive into advanced options of influencing its output using additional information. Then, we will show how to extract such information from r2, and how to put it all together to make a RetDec-in-r2 decompilation plugin. We demonstrate its capabilities in a short live demo. Furthermore, we explore tighter integration with Cutter and possible future improvements.</p>",
          "time": "11:40 - 12:25"
        },
        {
          "title": "Not only Street Fighter: A journey into Moo",
          "speakers": [
            "Pau Oliva",
            "Synacktiv"
          ],
          "handles": [
            "pof",
            "synacktiv"
          ],
          "description": "<p>We will talk about the emulator used in Street Fighter 30th Anniversary Edition: the emulator internals and how we instrument it to run different games.</p>",
          "time": "12:30 - 13:15"
        },
        {
          "title": "Lunch time",
          "time": "13:15 - 14:55"
        },
        {
          "title": "radare2 and Frida in the OWASP Mobile Security Testing Guide",
          "speakers": "Carlos Holguera",
          "handles": [
            "grepharder"
          ],
          "description": "<p>In this talk we will give a brief introduction to the OWASP Mobile Security Testing Guide: what is it, how to use it and how to contribute. In addition, we will introduce some use cases where we usually make use of radare2 and Frida when testing mobile apps and that can be found throughout the guide.</p>",
          "time": "15:00 - 15:30"
        },
        {
          "title": "Down the business with r2dwarf",
          "speakers": "iGio",
          "description": "<p>In this talk I'm going to show how you can debug, reverse engineer and break with ease some of the harder protections used nowadays to protect intellectual property and users sensitive data. We will see how a combination of tools built on top of frida and r2 can be used to win almost any situations</p>",
          "time": "15:35 - 16:20"
        },
        {
          "title": "tbd",
          "time": "16:25 - 16:45"
        },
        {
          "title": "25 minutes break",
          "time": "16:45 - 17:10"
        },
        {
          "title": "A journey through ESIL: understanding code emulation within radare2",
          "speakers": "Arnau Gàmez i Montolio",
          "handles": "arnaugamez",
          "description": "<p>This talk will serve as an introduction to ESIL in order to understand  the basics of code emulation within radare2.</p>",
          "time": "17:15 - 17:40"
        },
        {
          "title": "Narrowing semantinc gap in binary analysis",
          "speakers": [
            "Solmaz Salimi",
            "factoreal"
          ],
          "handles": [
            "y3noor",
            "factoreal"
          ],
          "description": "<p>One of the promising binary analysis techniques is binary partitioning based on function-level boundaries; without it, it is impractical to analyze binary files for most applications, including vulnerability search, binary instrumentation, and binary similarity detection. Although because of the overlapping instructions and the fact that disassembling a stripped binary file is equivalent to the halting problem, modern binary disassemblers including Radare2, this elegant and decent open-source software, achieve high accuracy in term of instruction recovery. Although, in most cases, accurate instruction recovery does not necessarily imply that function identification is as assuring. However, Radare2 provides an active core to identify the function-level boundaries; given a memory address that points to an instruction, it is possible to get the function that instruction belongs to it with a straightforward step.</p><p>In this talk, we are going to elaborate on how to function identification is done in Radare2 and then discuss how the function-level boundaries do not bridge the semantic-gap for binary analysis and on the other hand, developing a core to extract binary semantics is not as straightforward and accurate as function identifications.</p><p>Then we discuss how the function-level boundaries can be refined in Radare2 to obtain further semantic-based functionalities rather than comparable source-code level functions.</p>",
          "time": "17:45 - 18:15"
        },
        {
          "title": "TEB/PEB/../DLL binary Blob for ESIL to parse",
          "speakers": "Dennis",
          "description": "<p> A common trick in Windows malware and shellcode is to walk various structures down to the exported DLL function names. To discover the functions used, the reverser typically lets the binary run until all the important function pointers are saved. This means starting a Windows VM and debugging. I try to avoid using Windows whenever possible, so I took the longer route of reproducing the needed Windows structures as a binary blob in r2's memory. ESIL can then be used to emulate the malware until all the functions are exposed. Since Windows is never even used, this approach might allow for easier automation.</p>",
          "time": "18:20 - 19:05"
        }
      ]
    },
    {
      "date": "7",
      "day": "Saturday",
      "description": "Conference talks",
      "events": [
        {
          "title": "Object Diversification with the help of r2",
          "speakers": "Alex Gaines",
          "description": "<p>Software diversification is a well-established method of mitigating the risk of vulnerabilities; ASLR functionality is included in most modern operating systems. By employing software diversification techniques, we aim to increase attacker workload by thwarting vulnerability amplification. In this talk, we leverage radare2’s analysis library, “LibR”, to obfuscate, diversify, and protect objects compiled for Intel’s x86_64 platform. We use LibR to implement techniques such as junk code insertion, stack register reordering, stack frame modification, and help solve the complications that come with them.</p>",
          "time": "09:00 - 09:30"
        },
        {
          "title": "Dissecting Smart Contracts with r2",
          "speakers": "Silur",
          "description": "<p>We know from the past that EVM is prone to design flaws that could lead to serious leaks from greedy and suicidal contracts.</p><p>There are several specific tools in the OSS community to search for these, mostly symbolic executors.</p><p>In this talk we show how scripting radare can be used for more generic analysis.</p>",
          "time": "09:30 - 10:15"
        },
        {
          "title": "Detecting and reversing crypto patterns - the r2 way",
          "speakers": "Adir Abraham",
          "handles": "adirab",
          "description": "<p>Crypto? radare2? oh my! In this presentation we will walk through some famous cryptosystems and provide tips and tricks to detect cryptographic patterns using classic and creative reverse engineering techniques - the radare2 way.</p>",
          "time": "10:20 - 11:05"
        },
        {
          "title": "20 minutes break",
          "time": "11:05 - 11:25"
        },
        {
          "title": "Windows Malware Analysis with r2 for Beginners",
          "speakers": "Abraham Pasamar",
          "handles": "apasamar",
          "description": "<p>This talk is intended as a guide for assistants to understand how to start analysing a PE malware binary.</p>",
          "time": "11:30 - 12:15"
        },
        {
          "title": "Me and You and Everyone we debug",
          "speakers": "anonymous",
          "description": "<p>Using radare2 and PIN to create a tracing tool for debugging</p>",
          "time": "12:20 - 13:05"
        },
        {
          "title": "Lunch time",
          "time": "13:05 - 14:45"
        },
        {
          "title": "r2lrn - Your Personal Interactive Teacher",
          "speakers": "Kirils Solovjovs",
          "handles": "KirilsSolovjovs",
          "description": "<p>The talk presents the completely revolutionary tool to learn to use r2 the fun way — r2lrn. This is command-line based tutorial/challenge with progressive difficulty. Currently it is aimed at beginners (and IDA/gdb refugees), but framework can be easily extended in the future to include actually challenging tasks up to CTF level.</p>",
          "time": "14:50 - 15:20"
        },
        {
          "title": "ELF Crafting. Uncovering Advance Anti-analysis techniques for the Linux Platform.",
          "speakers": "Nacho Sanmillan",
          "handles": "ulexec",
          "description": "<p>Linux Malware is becoming more complex as newer Linux dominated ecosystems rise in today's IT landscape.</p><p>There is not much visibility of the Linux Threat Landscape and its capabilities. Recently, the security community has experienced a rise of awareness of Linux Threats as more malware is being found on this platform.</p><p>This talk will not be based on common Linux Malware but on advanced anti-analysis techniques that could make Linux Malware harder to analyse as a rise of awareness attempt of modern Linux Threats.</p>",
          "time": "15:25 - 16:10"
        },
        {
          "title": "ESIL applied for Graphs and Analysis",
          "speakers": "Condret",
          "handles": "condr3t",
          "description": "<p>Improving analysis in r2 by focusing on graphs generated from esil seems doable. In this talk, I tell you about how I want to generate esil expressions that compute what we want to know from graphs that were generated from esil expression themself.</p>",
          "time": "16:15 - 17:00"
        },
        {
          "title": "30 minutes break",
          "time": "17:00 - 17:30"
        },
        {
          "title": "RSoC 2019",
          "speakers": [
            "XVilka",
            "pancake"
          ],
          "handles": [
            "akochkov",
            "trufae"
          ],
          "description": "<p>This year's students in the Radare Summer of Code program will speak about their work on radare2. How they made radare2 console experience more robust, and describe recent improvements to the type analysis algorithms.</p>",
          "time": "17:35 - 18:20"
        },
        {
          "title": "Closing and Competition Winners",
          "time": "18:25 - 19:00"
        },
        {
          "title": "Chiptune Party",
          "speakers": [
          ],
          "handles": [
          ],
          "description": "<p>Join us to end r2con 2019 with a Chiptune party!</p>",
          "time": "22:00 - "
        }
      ]
    }
  ]
}
